#include <iostream>
#include "head.h"
using namespace std;

int main()
{
    /*
        // 走迷宫

        // 由于二维数组不能直接做函数的参数
        // 所以定义一维指针数组，存放一维数组
        int *arr[4];

        // 定义五个一维数组，用来定义迷宫坐标。
        // 这个迷宫只有一条路径可通，即所有 0 的位置连起来的路径
        // 最外围的一圈 1 是多加的墙，实际迷宫只有内部 3X3 大小的位置
        int a[5] = {1, 1, 1, 1, 1};
        int b[5] = {1, 0, 1, 1, 1};
        int c[5] = {1, 0, 0, 1, 1};
        int d[5] = {1, 1, 0, 0, 1};
        int f[5] = {1, 1, 1, 1, 1};

        // 将五个一维数组添加到一维指针数组 arr
        arr[0] = a;
        arr[1] = b;
        arr[2] = c;
        arr[3] = d;
        arr[4] = f;
        MazeLinkStack S; // 实例化一个迷宫的链栈

        // 迷宫起点是 (1,1)，迷宫实际大小 (m,n) 是 (3,3)
        mazepath(arr, 1, 1, 3, 3, S);
    */
    return 0;
}